In [12]:
import numpy as np
import pandas as pd
s1 = np.random.randint(10,size=4)
s2 = np.random.randint(10,size=4)
s3 = np.random.randint(10,size=4)

In [8]:
sozluk = {"var1": s1,"var2": s2,"var3": s3}
sozluk

{'var1': array([8, 5, 2, 8]),
 'var2': array([9, 4, 7, 0]),
 'var3': array([1, 6, 0, 0])}

In [39]:
df= pd.DataFrame(sozluk)
df

   var1  var2  var3
0     8     9     1
1     5     4     6
2     2     7     0
3     8     0     0

In [23]:
df[:2]

   var1  var2  var3
0     8     9     1
1     5     4     6

RangeIndex(start=0, stop=4, step=1)

In [41]:
df.index = ["a","b","c","d"]

In [42]:
df

   var1  var2  var3
a     8     9     1
b     5     4     6
c     2     7     0
d     8     0     0

In [31]:
# Eger bir silme işlemi yapılacaksa drop argumannı kullanırız. kalıcıolmasını istersek inplace =true kullanılır

In [43]:
df.drop("a",axis=0, inplace= True)

In [38]:
df # A SATIRI GİTTİ

   var1  var2  var3
b     5     4     6
c     2     7     0
d     8     0     0

In [46]:
df= pd.DataFrame(sozluk)
df                    #df tekrar cagiralım

   var1  var2  var3
0     8     9     1
1     5     4     6
2     2     7     0
3     8     0     0

In [48]:
# eger tabloda 1 ile 2 nin satır olarak sinmesini istersek liste tanımlarız sonra o listeyii sileriz

In [49]:
l=[2,3]

In [50]:
l

[2, 3]

In [52]:
df.drop(l,axis=0) # 2 ve 3 uncu satır silindi. fakat kalıcı olarak degil kalıcı olamsını istersek inplace kullanmalyız

   var1  var2  var3
0     8     9     1
1     5     4     6

In [54]:
 # DEGİŞKENLERİ (COLUMNS) da işlem yapma  yine bir liste tanımlayıp for döngüsü ile kullanabilirz

In [57]:
l=["var1", "var4","var2","var5"]

In [58]:
for i in l:
    print(i in df)

True
False
True
False

In [59]:
# olanlar için true olmayanlar için folse döndürdü

In [60]:
# yeni bir değişken oluşturma

In [64]:
df["var4"] = df["var1"]/df["var2"]

In [62]:
df

   var1  var2  var3      var4
0     8     9     1  0.888889
1     5     4     6  1.250000
2     2     7     0  0.285714
3     8     0     0       inf

In [65]:
l=["var1","var4"]

In [67]:
df.drop(l, axis=1) #var1 ve var4 sutunları silindi fakat kalıcı olarak degil.

   var2  var3
0     9     1
1     4     6
2     7     0
3     0     0